<?php
ini_set("arg_seperator.output", "&amp;");
ini_set("magic_quotes_gpc", 0);
ini_set("magic_quotes_sybase", 0);
ini_set("magic_quotes_runtime", 0);
ini_set('display_errors', 1);
ini_set("memory_limit", "2048M");
include_once (dirname(__FILE__) . "/../../sys/PathDefine.php");
include_once (ROOT_TOP_PATH . "/cron/Assembly.php");
mb_internal_encoding("UTF-8");

TheSystem::init(__FILE__);

// Debug::$debug = 'Dev';

class Init_doctor_auditorid_market_for_ADHD
{

    public function dowork () {
        $unitofwork = BeanFinder::get("UnitOfWork");

        $arr = array(
            "上海交通大学医学院附属上海儿童医学中心" => "汪阳",
            "上海交通大学附属儿童医院" => "汪阳",
            "上海市儿童医院" => "汪阳",
            "上海市第六人民医院" => "汪阳",
            "上海市精神卫生中心" => "汪阳",
            "上海新华医院" => "汪阳",
            "上海长海医院" => "汪阳",
            "东南大学附属中大医院" => "田运幸",
            "中南大学湘雅三医院" => "陈婷婷",
            "中南大学湘雅二医院" => "陈婷婷",
            "中南大学湘雅二院" => "陈婷婷",
            "中南大学湘雅医院" => "陈婷婷",
            "中国中医科学院广安门医院" => "金鹏",
            "中国人民解放军总医院" => "金鹏",
            "中国人民解放军第463医院" => "金鹏",
            "中国人民解放军第464医院" => "金鹏",
            "中国医学科学院肿瘤医院" => "金鹏",
            "中国医科大学附属盛京医院" => "田运幸",
            "中国医科大学附属第一医院" => "田运幸",
            "中山大学附属第一医院" => "汪阳",
            "中山大学附属第三医院" => "汪阳",
            "中日友好医院" => "金鹏",
            "伊通满族自治县第一人民医院" => "金鹏",
            "伍仲珮纪念医院" => "汪阳",
            "佛山市中医院" => "汪阳",
            "佛山市妇幼保健院" => "汪阳",
            "佛山市第一人民医院" => "汪阳",
            "儿研所" => "金鹏",
            "北京301医院" => "金鹏",
            "北京中医医院" => "金鹏",
            "北京中医药大学东直门医院" => "金鹏",
            "北京京都儿童医院" => "金鹏",
            "北京华信医院(清华大学第一附属医院)" => "金鹏",
            "北京协和医院" => "金鹏",
            "北京协和医院" => "金鹏",
            "北京回龙观医院" => "金鹏",
            "北京大学人民医院" => "金鹏",
            "北京安定医院" => "金鹏",
            "北京小儿多动症测试医院" => "金鹏",
            "北京市宣武中医医院" => "金鹏",
            "北医六院" => "金鹏",
            "北大妇儿医院" => "金鹏",
            "华西医院" => "陈婷婷",
            "华西妇产儿童医院" => "陈婷婷",
            "协和医院" => "金鹏",
            "南京儿童医院" => "田运幸",
            "南京军区福州总医院" => "田运幸",
            "南京妇幼保健院" => "田运幸",
            "南京脑科医院" => "田运幸",
            "南昌大学第二附属医院" => "汪阳",
            "南海妇幼保健院" => "汪阳",
            "厦门大学附属第一医院" => "汪阳",
            "厦门市仙岳医院" => "汪阳",
            "厦门市儿童医院" => "汪阳",
            "厦门市妇幼保健院" => "汪阳",
            "吉林大学中日联谊医院" => "田运幸",
            "吉林大学白求恩第一医院" => "田运幸",
            "吉林大学第一医院" => "田运幸",
            "吉林大学第二医院" => "田运幸",
            "吉林省妇幼保健院" => "田运幸",
            "咸阳市彩虹医院" => "陈婷婷",
            "哈尔滨儿童医院" => "田运幸",
            "哈尔滨医科大学第二附属医院" => "田运幸",
            "哈尔滨医科大学第四附属医院" => "田运幸",
            "哈尔滨医科大学附属第一医院" => "田运幸",
            "哈尔滨医科大学附属第二医院" => "田运幸",
            "哈尔滨市中医医院" => "田运幸",
            "哈尔滨市妇幼保健院" => "田运幸",
            "哈尔滨市第一医院" => "田运幸",
            "唐山市妇幼保健院" => "田运幸",
            "四川省人民医院" => "陈婷婷",
            "四川省妇幼保健院" => "陈婷婷",
            "固始县中医院" => "陈婷婷",
            "复旦大学附属儿科医院" => "金鹏",
            "大连医科大学附属第一医院" => "田运幸",
            "大连市妇幼保健院" => "田运幸",
            "天津市儿童医院" => "闫苍",
            "天津市南开医院" => "闫苍",
            "天津市妇女儿童保健中心" => "闫苍",
            "天津市安定医院" => "闫苍",
            "安徽省儿童医院" => "汪阳","山东大学齐鲁医院" => "田运幸",
            "山东省中医院" => "田运幸","山东省千佛山医院" => "田运幸",
            "山东省立医院" => "田运幸","山东省精神卫生中心" => "田运幸",
            "山西大医院" => "陈婷婷","山西省中医院" => "陈婷婷",
            "山西省儿童医院" => "陈婷婷","常州市第一人民医院" => "田运幸",
            "广东三九脑科医院" => "汪阳","广东医科大学附属医院" => "汪阳",
            "广东省中医院" => "汪阳","广东省人民医院" => "汪阳",
            "广东省妇幼保健院" => "汪阳","广州中医药大学附属第一医院" => "汪阳",
            "广州医学院荔湾医院" => "汪阳","广州医科大学附属第一医院" => "汪阳",
            "广州医科大学附属第二医院" => "汪阳","广州南方医院" => "汪阳",
            "广州妇女儿童医疗中心" => "汪阳","广州市妇女儿童医疗中心" => "汪阳",
            "广州市惠爱医院" => "汪阳",
            "广州市惠爱医院" => "汪阳","广州市红十字会医院" => "汪阳",
            "广州市越秀区儿童医院" => "汪阳",
            "广西壮族自治区人民医院" => "金鹏","徐州医学院附属医院" => "田运幸",
            "徐州市儿童医院" => "田运幸","成都市妇女儿童中心医院" => "陈婷婷",
            "成都新世纪妇女儿童医院" => "陈婷婷","成都锦二医院" => "陈婷婷",
            "新疆医科大学第二附属医院" => "金鹏","无锡市第八人民医院" => "田运幸",
            "昆明医科大学第一附属医院" => "金鹏",
            "昆明市儿童医院" => "金鹏","暨南大学附属第一医院" => "汪阳",
            "杭州市第一人民医院" => "汪阳",
            "杭州市第七人民医院" => "汪阳","杭州师范大学附属医院" => "汪阳",
            "武汉协和医院" => "陈婷婷",
            "武汉同济医院" => "陈婷婷","武汉市中医院" => "陈婷婷",
            "武汉市妇女儿童医疗保健中心" => "陈婷婷","武汉市第一医院" => "陈婷婷",
            "武汉精神卫生中心" => "陈婷婷","江苏省中医院" => "田运幸",
            "江西省儿童医院" => "汪阳","江西省妇幼保健院" => "汪阳",
            "沈阳军区总医院" => "田运幸","沈阳市儿童医院" => "田运幸",
            "沈阳市精神卫生中心" => "田运幸","河北医科大学第二医院" => "田运幸",
            "河北省中医院" => "田运幸","河北省人民医院" => "田运幸",
            "河北省儿童医院" => "田运幸","河南中医学院第一附属医院" => "陈婷婷",
            "泉州市儿童医院" => "汪阳","泉州市第一医院" => "汪阳",
            "泉州市第三医院" => "汪阳","济南军区总医院" => "田运幸",
            "济南市儿童医院" => "田运幸",
            "济南市妇幼保健院" => "田运幸","济宁医学院附属医院" => "田运幸",
            "浙江大学医学院附属儿童医院" => "汪阳","浙江省中医院" => "汪阳",
            "浙江省人民医院" => "汪阳","浙江萧山医院" => "汪阳",
            "深圳市儿童医院" => "汪阳","深圳市南山区妇幼保健院" => "汪阳",
            "深圳市妇幼保健院" => "汪阳","深圳市精神卫生中心" => "汪阳",
            "深圳市远东妇儿医院" => "汪阳","深圳远东妇儿医院" => "汪阳",
            "湖北省中医院" => "陈婷婷","湖北省人民医院" => "陈婷婷",
            "湖北省妇幼保健院" => "陈婷婷","湖南省人民医院" => "陈婷婷",
            "湖南省儿童医院" => "陈婷婷","湖南省妇幼保健院" => "陈婷婷",
            "漳州市芗城区妇幼保健院" => "汪阳","甘肃省妇幼保健院" => "金鹏",
            "白求恩国际和平医院" => "田运幸","石家庄市儿童医院" => "田运幸",
            "福建医科大学附属第二医院" => "汪阳",
            "福建协和医院" => "汪阳","福建省妇幼保健院" => "汪阳",
            "福建省福州儿童医院" => "汪阳","福建省立医院" => "汪阳",
            "福建省龙岩市第三医院" => "汪阳","秦皇岛市妇幼保健院" => "田运幸",
            "第三军医大学新桥医院" => "陈婷婷","第四军医大学西京医院" => "陈婷婷",
            "苏州大学附属儿童医院" => "田运幸","苏州市立医院" => "田运幸","苏州广济医院" => "田运幸",
            "西北妇女儿童医院" => "陈婷婷","西南儿童医院" => "陈婷婷",
            "西安交通大学第一附属医院" => "陈婷婷",
            "西安交通大学第二附属医院" => "陈婷婷","西安市儿童医院" => "陈婷婷",
            "西安市妇幼保健院" => "陈婷婷","西安市第一医院" => "陈婷婷",
            "西安市精神卫生中心" => "陈婷婷","辽宁中医药大学附属医院" => "田运幸",
            "连云港市妇幼保健院" => "田运幸",
            "通化市第二人民医院" => "田运幸","郑州儿童医院" => "陈婷婷",
            "郑州大学三附院" => "陈婷婷","郑州大学第一附属医院" => "陈婷婷",
            "郑州大学第三附属医院" => "陈婷婷",
            "郑州大学第二附属医院" => "陈婷婷","郑州市中心医院" => "陈婷婷",
            "郑州市儿童医院" => "陈婷婷","重庆医科大学儿童医院" => "陈婷婷",
            "重庆市妇幼保健院" => "陈婷婷",
            "重庆新桥医院" => "陈婷婷","长征医院" => "闫苍",
            "长春中医药大学附属医院" => "田运幸","长春市儿童医院" => "田运幸",
            "长沙市妇幼保健院" => "陈婷婷",
            "陕西省人民医院" => "陈婷婷","青岛大学附属医院" => "田运幸",
            "青岛市妇女儿童医院" => "田运幸",
            "青岛市立医院" => "田运幸","青岛市精神卫生中心" => "田运幸",
            "首都医科大学宣武医院" => "金鹏",
            "首都医科大学附属北京儿童医院" => "金鹏",
            "黑龙江中医药大学附属第二医院" => "田运幸",
            "黑龙江省医院" => "田运幸");

        foreach ($arr as $hospital_name => $auditor_name) {
            $hospital = Dao::getEntityByCond("Hospital", " and name like '%{$hospital_name}%' ");
            $auditor = Dao::getEntityByCond("Auditor", " and name like '%{$auditor_name}%' ");

            if(false == $hospital instanceof Hospital){
                echo "===[没有找到医院]==========【{$hospital_name}】==\n";
                continue;
            }
            if(false == $auditor instanceof Auditor){
                echo "===[没有找到市场人]=========【{$auditor_name}】==\n";
                continue;
            }

            $result = $this->changeAuditorMarket($hospital->id, $auditor->id);

            if($result){
                echo "===[变更成功]==============【{$hospital_name}】==\n";
            }else {
                echo "===[没有查询到医生]=========【{$hospital_name}】==\n";
            }
        }

        $unitofwork->commitAndInit();
    }

    public function changeAuditorMarket ($hospitalid, $auditorid) {
        $sql = " select a.* from doctors a
            inner join doctordiseaserefs b on b.doctorid=a.id
            where b.diseaseid=1 ";
        $bind = [];

        $sql .= " and a.hospitalid=:hospitalid ";
        $bind[':hospitalid'] = $hospitalid;

        $doctors = Dao::loadEntityList("Doctor", $sql, $bind);

        if(count($doctors)>0){
            foreach ($doctors as $doctor) {
                $doctor->auditorid_market = $auditorid;
            }

            //变更成功
            return true;
        }else{

            //没有查询到要变更的医生
            return false;
        }
    }
}

echo "\n\n-----begin----- " . XDateTime::now();
Debug::trace("=====[cron][beg][Init_doctor_auditorid_market_for_ADHD.php]=====");

$process = new Init_doctor_auditorid_market_for_ADHD();
$process->dowork();

Debug::trace("=====[cron][end][Init_doctor_auditorid_market_for_ADHD.php]=====");
Debug::flushXworklog();
echo "\n-----end----- " . XDateTime::now();
